before echo before
tap 'caskroom/cask'
tap 'homebrew/binary'
tap 'homebrew/dupes'

brew 'autojump'
brew 'archey'
brew 'aspell', args: ['with-lang-ru', 'with-lang-uk', 'with-lang-pl', 'with-lang-en']
brew 'axel'
brew 'bash'
brew 'boot2docker'
brew 'curl'
brew 'coreutils'
brew 'ctags'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'emacs'
brew 'elasticsearch'
brew 'geoip'
brew 'git'
brew 'git-flow'
brew 'go'
brew 'gmp'
brew 'heroku'
brew 'heroku-toolbelt'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'icu4c'
brew 'irssi'
brew 'imagemagick'
#brew 'lynx'
brew 'mas'
brew 'mc'
brew 'memcached'
brew 'mysql', restart_service: true
brew 'ncdu'
brew 'nmap'

brew 'openssl'
brew 'peco'
brew 'postgres', restart_service: true
brew 'pyenv'
brew 'python'
brew 'python3'
brew 'qt5'
brew 'redis', restart_service: true
brew 'siege'
brew 'speedtest-cli'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'thefuck'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'v8'
brew 'vim', args: ['with-override-system-vi']
brew 'watch'
brew 'weechat', args: ['with-aspell', 'with-curl', 'with-lua', 'with-perl', 'with-python', 'with-ruby']
brew 'wget'
brew 'xz'
brew 'zsh'
brew 'youtube-dl'
brew 'z'

tap 'homebrew/completions'
brew 'rails-completion'

cask_args appdir: '~/Applications'
#cask 'air-video-server-hd'
##, args: { appdir: '/Applications' }
# cask 'abricotine' Markdown editor
cask 'appcleaner'
#cask 'atom'
cask 'caffeine'
cask 'chromium'
cask 'dash'
cask 'dropbox'
cask 'espresso'
cask 'filezilla'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'macdown'
# cask 'mou' Markdown editor
cask 'no-ip-duc'
cask 'ngrok'
cask 'qbittorrent'
cask 'qt-creator'
#cask 'seil'
cask 'sequel-pro'
cask 'skype'
#cask 'steam'
cask 'sublime-text'
cask 'slack'
cask 'sourcetree'
cask 'teamviewer'
cask 'toggldesktop'
cask 'transmission'
cask 'tunnelbear'
# cask 'tower'
cask 'vagrant'
cask 'viber'
cask 'virtualbox'
cask 'vlc'
#cask 'vox-preferences-pane'
#cask 'vox'


tap 'caskroom/fonts'
cask 'font-devicons'
cask 'font-fontawesome'
cask 'font-noto-sans'
cask 'font-noto-sans-cjk-jp'
cask 'font-noto-serif'

cask 'font-hack'
cask 'font-source-code-pro'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'


# appstore 409183694 Keynote (7.0.5)
appstore 409222199 Cyberduck (5.3.7)
appstore 409203825 Numbers (4.0.5)
appstore 409201541 Pages (6.0.5)
appstore 497799835 Xcode (8.2.1)
# appstore 408981434 iMovie (10.1.4)

# Other commands
echo other commands

# After commands
after echo after
